---
kind: method
id: M:Autodesk.Revit.DB.LinePatternSegment.#ctor(Autodesk.Revit.DB.LinePatternSegmentType,System.Double)
source: html/63fc895f-102d-db49-ea4e-d7d9963567f2.htm
---
# Autodesk.Revit.DB.LinePatternSegment.#ctor Method

Creates a line pattern segment with given type and length.

## Syntax (C#)
```csharp
public LinePatternSegment(
	LinePatternSegmentType type,
	double length
)
```

## Parameters
- **type** (`Autodesk.Revit.DB.LinePatternSegmentType`) - The segment type.
- **length** (`System.Double`) - The length.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - A value passed for an enumeration argument is not a member of that enumeration